/*
                                                            Лабораторная работа 6
                                                             Гнетецкого Даниеля
                                                                  Вариант 2
         Условие: Имеются два двунаправленных упорядоченных кольца, в которых могут быть одинаковые элементы.
                  Объединить оба кольца в одно упорядоченное кольцо, исключив повторяющиеся элементы
 */






#include "headerRing.h"
#include "../myLibrary.h"


int main()
{

    return 0;
}